MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
/*  Bit definition for ADC_DR10 register  */
#define ADC_DR10                                       (0xFFFFU)

/*  Bit definition for ADC_DR11 register  */
#define ADC_DR11                                       (0xFFFFU)

/*  Bit definition for ADC_AWDCR register  */
#define ADC_AWDCR_AWD0EN_POS                           (0U)
#define ADC_AWDCR_AWD0EN                               (0x0001U)
#define ADC_AWDCR_AWD0IEN_POS                          (1U)
#define ADC_AWDCR_AWD0IEN                              (0x0002U)
#define ADC_AWDCR_AWD0MD_POS                           (2U)
#define ADC_AWDCR_AWD0MD                               (0x0004U)
#define ADC_AWDCR_AWD1EN_POS                           (4U)
#define ADC_AWDCR_AWD1EN                               (0x0010U)
#define ADC_AWDCR_AWD1IEN_POS                          (5U)
#define ADC_AWDCR_AWD1IEN                              (0x0020U)
#define ADC_AWDCR_AWD1MD_POS                           (6U)
#define ADC_AWDCR_AWD1MD                               (0x0040U)
#define ADC_AWDCR_AWDCM_POS                            (8U)
#define ADC_AWDCR_AWDCM                                (0x0300U)
#define ADC_AWDCR_AWDCM_0                              (0x0100U)
#define ADC_AWDCR_AWDCM_1                              (0x0200U)

/*  Bit definition for ADC_AWDSR register  */
#define ADC_AWDSR_AWD0F_POS                            (0U)
#define ADC_AWDSR_AWD0F                                (0x01U)
#define ADC_AWDSR_AWD1F_POS                            (1U)
#define ADC_AWDSR_AWD1F                                (0x02U)
#define ADC_AWDSR_AWDCMF_POS                           (4U)
#define ADC_AWDSR_AWDCMF                               (0x10U)

/*  Bit definition for ADC_AWDSCLRR register  */
#define ADC_AWDSCLRR_CLRAWD0F_POS                      (0U)
#define ADC_AWDSCLRR_CLRAWD0F                          (0x01U)
#define ADC_AWDSCLRR_CLRAWD1F_POS                      (1U)
#define ADC_AWDSCLRR_CLRAWD1F                          (0x02U)
#define ADC_AWDSCLRR_CLRAWDCMF_POS                     (4U)
#define ADC_AWDSCLRR_CLRAWDCMF                         (0x10U)

/*  Bit definition for ADC_AWD0DR0 register  */
#define ADC_AWD0DR0                                    (0xFFFFU)

/*  Bit definition for ADC_AWD0DR1 register  */
#define ADC_AWD0DR1                                    (0xFFFFU)

/*  Bit definition for ADC_AWD0CHSR register  */
#define ADC_AWD0CHSR_AWDCH                             (0x1FU)
#define ADC_AWD0CHSR_AWDCH_0                           (0x01U)
#define ADC_AWD0CHSR_AWDCH_1                           (0x02U)
#define ADC_AWD0CHSR_AWDCH_2                           (0x04U)
#define ADC_AWD0CHSR_AWDCH_3                           (0x08U)
#define ADC_AWD0CHSR_AWDCH_4                           (0x10U)

/*  Bit definition for ADC_AWD1DR0 register  */
#define ADC_AWD1DR0                                    (0xFFFFU)

/*  Bit definition for ADC_AWD1DR1 register  */
#define ADC_AWD1DR1                                    (0xFFFFU)

/*  Bit definition for ADC_AWD1CHSR register  */
#define ADC_AWD1CHSR_AWDCH                             (0x1FU)
#define ADC_AWD1CHSR_AWDCH_0                           (0x01U)
#define ADC_AWD1CHSR_AWDCH_1                           (0x02U)
#define ADC_AWD1CHSR_AWDCH_2                           (0x04U)
#define ADC_AWD1CHSR_AWDCH_3                           (0x08U)
#define ADC_AWD1CHSR_AWDCH_4                           (0x10U)

/*  Bit definition for ADC_OPACR register  */
#define ADC_OPACR_OPA1EN_POS                           (0U)
#define ADC_OPACR_OPA1EN                               (0x0001U)
#define ADC_OPACR_OPA2EN_POS                           (1U)
#define ADC_OPACR_OPA2EN                               (0x0002U)

/*******************************************************************************
                Bit definition for Peripheral AOS
*******************************************************************************/
/*  Bit definition for AOS_INTC_STRGCR register  */
#define AOS_INTC_STRGCR_STRG                           (0x00000001UL)

/*  Bit definition for AOS_EVPRT_CR register  */
#define AOS_EVPRT_CR_EVP1FEE_POS                       (0U)
#define AOS_EVPRT_CR_EVP1FEE                           (0x00000001UL)
#define AOS_EVPRT_CR_EVP2FEE_POS                       (1U)
#define AOS_EVPRT_CR_EVP2FEE                           (0x00000002UL)
#define AOS_EVPRT_CR_EVP3FEE_POS                       (2U)
#define AOS_EVPRT_CR_EVP3FEE                           (0x00000004UL)
#define AOS_EVPRT_CR_EVP4FEE_POS                       (3U)
#define AOS_EVPRT_CR_EVP4FEE                           (0x00000008UL)
#define AOS_EVPRT_CR_EVP1REE_POS                       (4U)
#define AOS_EVPRT_CR_EVP1REE                           (0x00000010UL)
#define AOS_EVPRT_CR_EVP2REE_POS                       (5U)
#define AOS_EVPRT_CR_EVP2REE                           (0x00000020UL)
#define AOS_EVPRT_CR_EVP3REE_POS                       (6U)
#define AOS_EVPRT_CR_EVP3REE                           (0x00000040UL)
#define AOS_EVPRT_CR_EVP4REE_POS                       (7U)
#define AOS_EVPRT_CR_EVP4REE                           (0x00000080UL)
#define AOS_EVPRT_CR_EVPDIVS_POS                       (8U)
#define AOS_EVPRT_CR_EVPDIVS                           (0x00000300UL)
#define AOS_EVPRT_CR_EVPDIVS_0                         (0x00000100UL)
#define AOS_EVPRT_CR_EVPDIVS_1                         (0x00000200UL)
#define AOS_EVPRT_CR_EVPNFE_POS                        (10U)
#define AOS_EVPRT_CR_EVPNFE                            (0x00000400UL)

/*  Bit definition for AOS_EVPRT_SR register  */
#define AOS_EVPRT_SR_PTSTS0_POS                        (0U)
#define AOS_EVPRT_SR_PTSTS0                            (0x0000000FUL)
#define AOS_EVPRT_SR_PTSTS0_0                          (0x00000001UL)
#define AOS_EVPRT_SR_PTSTS0_1                          (0x00000002UL)
#define AOS_EVPRT_SR_PTSTS0_2                          (0x00000004UL)
#define AOS_EVPRT_SR_PTSTS0_3                          (0x00000008UL)
#define AOS_EVPRT_SR_PTSTS1_POS                        (4U)
#define AOS_EVPRT_SR_PTSTS1                            (0x000000F0UL)
#define AOS_EVPRT_SR_PTSTS1_0                          (0x00000010UL)
#define AOS_EVPRT_SR_PTSTS1_1                          (0x00000020UL)
#define AOS_EVPRT_SR_PTSTS1_2                          (0x00000040UL)
#define AOS_EVPRT_SR_PTSTS1_3                          (0x00000080UL)
#define AOS_EVPRT_SR_PTSTS2_POS                        (8U)
#define AOS_EVPRT_SR_PTSTS2                            (0x00000F00UL)
#define AOS_EVPRT_SR_PTSTS2_0                          (0x00000100UL)
#define AOS_EVPRT_SR_PTSTS2_1                          (0x00000200UL)
#define AOS_EVPRT_SR_PTSTS2_2                          (0x00000400UL)
#define AOS_EVPRT_SR_PTSTS2_3                          (0x00000800UL)
#define AOS_EVPRT_SR_PTSTS3_POS                        (12U)
#define AOS_EVPRT_SR_PTSTS3                            (0x0000F000UL)
#define AOS_EVPRT_SR_PTSTS3_0                          (0x00001000UL)
#define AOS_EVPRT_SR_PTSTS3_1                          (0x00002000UL)
#define AOS_EVPRT_SR_PTSTS3_2                          (0x00004000UL)
#define AOS_EVPRT_SR_PTSTS3_3                          (0x00008000UL)

