MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
/*******************************************************************************
                Bit definition for Peripheral DBGC
*******************************************************************************/
/*  Bit definition for DBGC_MCUDBGSTAT register  */
#define DBGC_MCUDBGSTAT_CDBGPWRUPREQ_POS               (0U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPREQ                   (0x00000001UL)
#define DBGC_MCUDBGSTAT_CDBGPWRUPACK_POS               (1U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPACK                   (0x00000002UL)

/*  Bit definition for DBGC_MCUSTPCTL register  */
#define DBGC_MCUSTPCTL_SWDTSTP_POS                     (0U)
#define DBGC_MCUSTPCTL_SWDTSTP                         (0x00000001UL)
#define DBGC_MCUSTPCTL_RTCSTP_POS                      (2U)
#define DBGC_MCUSTPCTL_RTCSTP                          (0x00000004UL)
#define DBGC_MCUSTPCTL_TMR01STP_POS                    (14U)
#define DBGC_MCUSTPCTL_TMR01STP                        (0x00004000UL)
#define DBGC_MCUSTPCTL_TMR21STP_POS                    (17U)
#define DBGC_MCUSTPCTL_TMR21STP                        (0x00020000UL)
#define DBGC_MCUSTPCTL_TMR41STP_POS                    (20U)
#define DBGC_MCUSTPCTL_TMR41STP                        (0x00100000UL)
#define DBGC_MCUSTPCTL_TMRA1STP_POS                    (23U)
#define DBGC_MCUSTPCTL_TMRA1STP                        (0x00800000UL)
#define DBGC_MCUSTPCTL_TMRB1STP_POS                    (24U)
#define DBGC_MCUSTPCTL_TMRB1STP                        (0x01000000UL)
#define DBGC_MCUSTPCTL_TMRB2STP_POS                    (25U)
#define DBGC_MCUSTPCTL_TMRB2STP                        (0x02000000UL)
#define DBGC_MCUSTPCTL_TMRB3STP_POS                    (26U)
#define DBGC_MCUSTPCTL_TMRB3STP                        (0x04000000UL)
#define DBGC_MCUSTPCTL_TMRB4STP_POS                    (27U)
#define DBGC_MCUSTPCTL_TMRB4STP                        (0x08000000UL)
#define DBGC_MCUSTPCTL_TMRB5STP_POS                    (28U)
#define DBGC_MCUSTPCTL_TMRB5STP                        (0x10000000UL)
#define DBGC_MCUSTPCTL_TMRB6STP_POS                    (29U)
#define DBGC_MCUSTPCTL_TMRB6STP                        (0x20000000UL)
#define DBGC_MCUSTPCTL_TMRB7STP_POS                    (30U)
#define DBGC_MCUSTPCTL_TMRB7STP                        (0x40000000UL)
#define DBGC_MCUSTPCTL_TMRB8STP_POS                    (31U)
#define DBGC_MCUSTPCTL_TMRB8STP                        (0x80000000UL)

/*******************************************************************************
                Bit definition for Peripheral DBGC_T
*******************************************************************************/
/*  Bit definition for DBGC_T_AUTHID0 register  */
#define DBGC_T_AUTHID0                                 (0xFFFFFFFFUL)

/*  Bit definition for DBGC_T_AUTHID1 register  */
#define DBGC_T_AUTHID1                                 (0xFFFFFFFFUL)

/*  Bit definition for DBGC_T_AUTHID2 register  */
#define DBGC_T_AUTHID2                                 (0xFFFFFFFFUL)

/*  Bit definition for DBGC_T_RESV0 register  */
#define DBGC_T_RESV0                                   (0xFFFFFFFFUL)

/*  Bit definition for DBGC_T_MCUSTAT register  */
#define DBGC_T_MCUSTAT_AUTH_POS                        (0U)
#define DBGC_T_MCUSTAT_AUTH                            (0x00000001UL)
#define DBGC_T_MCUSTAT_REMVLOCK_POS                    (1U)
#define DBGC_T_MCUSTAT_REMVLOCK                        (0x00000002UL)
#define DBGC_T_MCUSTAT_SAFTYLOCK1_POS                  (2U)
#define DBGC_T_MCUSTAT_SAFTYLOCK1                      (0x00000004UL)
#define DBGC_T_MCUSTAT_SAFTYLOCK2_POS                  (3U)
#define DBGC_T_MCUSTAT_SAFTYLOCK2                      (0x00000008UL)
#define DBGC_T_MCUSTAT_MCUSTAT0_POS                    (8U)
#define DBGC_T_MCUSTAT_MCUSTAT0                        (0x00000100UL)
#define DBGC_T_MCUSTAT_MCUSTAT1_POS                    (9U)
#define DBGC_T_MCUSTAT_MCUSTAT1                        (0x00000200UL)

/*  Bit definition for DBGC_T_MCUCTL register  */
#define DBGC_T_MCUCTL_EDBGRQ_POS                       (0U)
#define DBGC_T_MCUCTL_EDBGRQ                           (0x00000001UL)
#define DBGC_T_MCUCTL_RESTART_POS                      (1U)
#define DBGC_T_MCUCTL_RESTART                          (0x00000002UL)
#define DBGC_T_MCUCTL_DIRQ_POS                         (8U)
#define DBGC_T_MCUCTL_DIRQ                             (0x00000100UL)

/*  Bit definition for DBGC_T_FMCCTL register  */
#define DBGC_T_FMCCTL_ERASEREQ_POS                     (0U)
#define DBGC_T_FMCCTL_ERASEREQ                         (0x00000001UL)
#define DBGC_T_FMCCTL_ERASEACK_POS                     (1U)
#define DBGC_T_FMCCTL_ERASEACK                         (0x00000002UL)
#define DBGC_T_FMCCTL_ERASEERR_POS                     (2U)
#define DBGC_T_FMCCTL_ERASEERR                         (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral DMA
*******************************************************************************/
/*  Bit definition for DMA_EN register  */
#define DMA_EN_EN                                      (0x00000001UL)

/*  Bit definition for DMA_INTSTAT0 register  */
#define DMA_INTSTAT0_TRNERR_POS                        (0U)
#define DMA_INTSTAT0_TRNERR                            (0x00000003UL)
#define DMA_INTSTAT0_TRNERR_0                          (0x00000001UL)
#define DMA_INTSTAT0_TRNERR_1                          (0x00000002UL)
#define DMA_INTSTAT0_REQERR_POS                        (16U)
#define DMA_INTSTAT0_REQERR                            (0x00030000UL)
#define DMA_INTSTAT0_REQERR_0                          (0x00010000UL)
#define DMA_INTSTAT0_REQERR_1                          (0x00020000UL)

/*  Bit definition for DMA_INTSTAT1 register  */
#define DMA_INTSTAT1_TC_POS                            (0U)
#define DMA_INTSTAT1_TC                                (0x00000003UL)
#define DMA_INTSTAT1_TC_0                              (0x00000001UL)
#define DMA_INTSTAT1_TC_1                              (0x00000002UL)
#define DMA_INTSTAT1_BTC_POS                           (16U)
#define DMA_INTSTAT1_BTC                               (0x00030000UL)
#define DMA_INTSTAT1_BTC_0                             (0x00010000UL)
#define DMA_INTSTAT1_BTC_1                             (0x00020000UL)

/*  Bit definition for DMA_INTMASK0 register  */
#define DMA_INTMASK0_MSKTRNERR_POS                     (0U)
#define DMA_INTMASK0_MSKTRNERR                         (0x00000003UL)
#define DMA_INTMASK0_MSKTRNERR_0                       (0x00000001UL)
#define DMA_INTMASK0_MSKTRNERR_1                       (0x00000002UL)
#define DMA_INTMASK0_MSKREQERR_POS                     (16U)
#define DMA_INTMASK0_MSKREQERR                         (0x00030000UL)
#define DMA_INTMASK0_MSKREQERR_0                       (0x00010000UL)
#define DMA_INTMASK0_MSKREQERR_1                       (0x00020000UL)

