MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
/*  Bit definition for DMA_INTMASK1 register  */
#define DMA_INTMASK1_MSKTC_POS                         (0U)
#define DMA_INTMASK1_MSKTC                             (0x00000003UL)
#define DMA_INTMASK1_MSKTC_0                           (0x00000001UL)
#define DMA_INTMASK1_MSKTC_1                           (0x00000002UL)
#define DMA_INTMASK1_MSKBTC_POS                        (16U)
#define DMA_INTMASK1_MSKBTC                            (0x00030000UL)
#define DMA_INTMASK1_MSKBTC_0                          (0x00010000UL)
#define DMA_INTMASK1_MSKBTC_1                          (0x00020000UL)

/*  Bit definition for DMA_INTCLR0 register  */
#define DMA_INTCLR0_CLRTRNERR_POS                      (0U)
#define DMA_INTCLR0_CLRTRNERR                          (0x00000003UL)
#define DMA_INTCLR0_CLRTRNERR_0                        (0x00000001UL)
#define DMA_INTCLR0_CLRTRNERR_1                        (0x00000002UL)
#define DMA_INTCLR0_CLRREQERR_POS                      (16U)
#define DMA_INTCLR0_CLRREQERR                          (0x00030000UL)
#define DMA_INTCLR0_CLRREQERR_0                        (0x00010000UL)
#define DMA_INTCLR0_CLRREQERR_1                        (0x00020000UL)

/*  Bit definition for DMA_INTCLR1 register  */
#define DMA_INTCLR1_CLRTC_POS                          (0U)
#define DMA_INTCLR1_CLRTC                              (0x00000003UL)
#define DMA_INTCLR1_CLRTC_0                            (0x00000001UL)
#define DMA_INTCLR1_CLRTC_1                            (0x00000002UL)
#define DMA_INTCLR1_CLRBTC_POS                         (16U)
#define DMA_INTCLR1_CLRBTC                             (0x00030000UL)
#define DMA_INTCLR1_CLRBTC_0                           (0x00010000UL)
#define DMA_INTCLR1_CLRBTC_1                           (0x00020000UL)

/*  Bit definition for DMA_CHEN register  */
#define DMA_CHEN_CHEN                                  (0x00000003UL)
#define DMA_CHEN_CHEN_0                                (0x00000001UL)
#define DMA_CHEN_CHEN_1                                (0x00000002UL)

/*  Bit definition for DMA_CHSTAT register  */
#define DMA_CHSTAT_DMAACT_POS                          (0U)
#define DMA_CHSTAT_DMAACT                              (0x00000001UL)
#define DMA_CHSTAT_CHACT_POS                           (16U)
#define DMA_CHSTAT_CHACT                               (0x00030000UL)
#define DMA_CHSTAT_CHACT_0                             (0x00010000UL)
#define DMA_CHSTAT_CHACT_1                             (0x00020000UL)

/*  Bit definition for DMA_CHENCLR register  */
#define DMA_CHENCLR_CHENCLR                            (0x00000003UL)
#define DMA_CHENCLR_CHENCLR_0                          (0x00000001UL)
#define DMA_CHENCLR_CHENCLR_1                          (0x00000002UL)

/*  Bit definition for DMA_SAR register  */
#define DMA_SAR                                        (0xFFFFFFFFUL)

/*  Bit definition for DMA_DAR register  */
#define DMA_DAR                                        (0xFFFFFFFFUL)

/*  Bit definition for DMA_CHCTL0 register  */
#define DMA_CHCTL0_BLKSIZE_POS                         (0U)
#define DMA_CHCTL0_BLKSIZE                             (0x000000FFUL)
#define DMA_CHCTL0_CNT_POS                             (8U)
#define DMA_CHCTL0_CNT                                 (0x0003FF00UL)
#define DMA_CHCTL0_LLP_POS                             (18U)
#define DMA_CHCTL0_LLP                                 (0x0FFC0000UL)
#define DMA_CHCTL0_LLPEN_POS                           (28U)
#define DMA_CHCTL0_LLPEN                               (0x10000000UL)
#define DMA_CHCTL0_LLPRUN_POS                          (29U)
#define DMA_CHCTL0_LLPRUN                              (0x20000000UL)
#define DMA_CHCTL0_HSIZE_POS                           (30U)
#define DMA_CHCTL0_HSIZE                               (0xC0000000UL)
#define DMA_CHCTL0_HSIZE_0                             (0x40000000UL)
#define DMA_CHCTL0_HSIZE_1                             (0x80000000UL)

/*  Bit definition for DMA_CHCTL1 register  */
#define DMA_CHCTL1_OFFSET_POS                          (0U)
#define DMA_CHCTL1_OFFSET                              (0x0000FFFFUL)
#define DMA_CHCTL1_RPTNSCNT_POS                        (16U)
#define DMA_CHCTL1_RPTNSCNT                            (0x00FF0000UL)
#define DMA_CHCTL1_RPTNSEN_POS                         (24U)
#define DMA_CHCTL1_RPTNSEN                             (0x01000000UL)
#define DMA_CHCTL1_RPTNSSEL_POS                        (25U)
#define DMA_CHCTL1_RPTNSSEL                            (0x06000000UL)
#define DMA_CHCTL1_RPTNSSEL_0                          (0x02000000UL)
#define DMA_CHCTL1_RPTNSSEL_1                          (0x04000000UL)
#define DMA_CHCTL1_SINC_POS                            (28U)
#define DMA_CHCTL1_SINC                                (0x30000000UL)
#define DMA_CHCTL1_SINC_0                              (0x10000000UL)
#define DMA_CHCTL1_SINC_1                              (0x20000000UL)
#define DMA_CHCTL1_DINC_POS                            (30U)
#define DMA_CHCTL1_DINC                                (0xC0000000UL)
#define DMA_CHCTL1_DINC_0                              (0x40000000UL)
#define DMA_CHCTL1_DINC_1                              (0x80000000UL)

/*******************************************************************************
                Bit definition for Peripheral EFM
*******************************************************************************/
/*  Bit definition for EFM_FAPRT register  */
#define EFM_FAPRT_FAPRT                                (0x0000FFFFUL)

/*  Bit definition for EFM_FSTP register  */
#define EFM_FSTP_FSTP                                  (0x00000001UL)

/*  Bit definition for EFM_FRMC register  */
#define EFM_FRMC_FLWT_POS                              (0U)
#define EFM_FRMC_FLWT                                  (0x00000001UL)
#define EFM_FRMC_CACHE_POS                             (16U)
#define EFM_FRMC_CACHE                                 (0x00010000UL)
#define EFM_FRMC_PREFETE_POS                           (17U)
#define EFM_FRMC_PREFETE                               (0x00020000UL)
#define EFM_FRMC_CRST_POS                              (18U)
#define EFM_FRMC_CRST                                  (0x00040000UL)

/*  Bit definition for EFM_FWMC register  */
#define EFM_FWMC_PEMODE_POS                            (0U)
#define EFM_FWMC_PEMODE                                (0x00000001UL)
#define EFM_FWMC_PEMOD_POS                             (4U)
#define EFM_FWMC_PEMOD                                 (0x00000070UL)
#define EFM_FWMC_BUSHLDCTL_POS                         (8U)
#define EFM_FWMC_BUSHLDCTL                             (0x00000100UL)

