MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
/*  Bit definition for EFM_FSR register  */
#define EFM_FSR_PEWERR_POS                             (0U)
#define EFM_FSR_PEWERR                                 (0x00000001UL)
#define EFM_FSR_PEPRTERR_POS                           (1U)
#define EFM_FSR_PEPRTERR                               (0x00000002UL)
#define EFM_FSR_PGMISMTCH_POS                          (3U)
#define EFM_FSR_PGMISMTCH                              (0x00000008UL)
#define EFM_FSR_OPTEND_POS                             (4U)
#define EFM_FSR_OPTEND                                 (0x00000010UL)
#define EFM_FSR_COLERR_POS                             (5U)
#define EFM_FSR_COLERR                                 (0x00000020UL)
#define EFM_FSR_RDY_POS                                (8U)
#define EFM_FSR_RDY                                    (0x00000100UL)

/*  Bit definition for EFM_FSCLR register  */
#define EFM_FSCLR_PEWERRCLR_POS                        (0U)
#define EFM_FSCLR_PEWERRCLR                            (0x00000001UL)
#define EFM_FSCLR_PEPRTERRCLR_POS                      (1U)
#define EFM_FSCLR_PEPRTERRCLR                          (0x00000002UL)
#define EFM_FSCLR_PGMISMTCHCLR_POS                     (3U)
#define EFM_FSCLR_PGMISMTCHCLR                         (0x00000008UL)
#define EFM_FSCLR_OPTENDCLR_POS                        (4U)
#define EFM_FSCLR_OPTENDCLR                            (0x00000010UL)
#define EFM_FSCLR_COLERRCLR_POS                        (5U)
#define EFM_FSCLR_COLERRCLR                            (0x00000020UL)

/*  Bit definition for EFM_FITE register  */
#define EFM_FITE_PEERRITE_POS                          (0U)
#define EFM_FITE_PEERRITE                              (0x00000001UL)
#define EFM_FITE_OPTENDITE_POS                         (1U)
#define EFM_FITE_OPTENDITE                             (0x00000002UL)
#define EFM_FITE_COLERRITE_POS                         (2U)
#define EFM_FITE_COLERRITE                             (0x00000004UL)

/*  Bit definition for EFM_FPMTSW register  */
#define EFM_FPMTSW_FPMTSW                              (0x00007FFFUL)

/*  Bit definition for EFM_FPMTEW register  */
#define EFM_FPMTEW_FPMTEW                              (0x00007FFFUL)

/*  Bit definition for EFM_UQID0 register  */
#define EFM_UQID0                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID1 register  */
#define EFM_UQID1                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID2 register  */
#define EFM_UQID2                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_HRCCFGR register  */
#define EFM_HRCCFGR_HRCFREQS                           (0x0FU)
#define EFM_HRCCFGR_HRCFREQS_0                         (0x01U)
#define EFM_HRCCFGR_HRCFREQS_1                         (0x02U)
#define EFM_HRCCFGR_HRCFREQS_2                         (0x04U)
#define EFM_HRCCFGR_HRCFREQS_3                         (0x08U)

/*  Bit definition for EFM_LVDICGCR register  */
#define EFM_LVDICGCR_DFS_POS                           (0U)
#define EFM_LVDICGCR_DFS                               (0x0003U)
#define EFM_LVDICGCR_DFS_0                             (0x0001U)
#define EFM_LVDICGCR_DFS_1                             (0x0002U)
#define EFM_LVDICGCR_DFDIS_POS                         (2U)
#define EFM_LVDICGCR_DFDIS                             (0x0004U)
#define EFM_LVDICGCR_LVDLVL_POS                        (8U)
#define EFM_LVDICGCR_LVDLVL                            (0x0F00U)
#define EFM_LVDICGCR_NMIS_POS                          (12U)
#define EFM_LVDICGCR_NMIS                              (0x1000U)
#define EFM_LVDICGCR_IRS_POS                           (13U)
#define EFM_LVDICGCR_IRS                               (0x2000U)
#define EFM_LVDICGCR_IRDIS_POS                         (14U)
#define EFM_LVDICGCR_IRDIS                             (0x4000U)
#define EFM_LVDICGCR_LVDDIS_POS                        (15U)
#define EFM_LVDICGCR_LVDDIS                            (0x8000U)

/*******************************************************************************
                Bit definition for Peripheral EMB
*******************************************************************************/
/*  Bit definition for EMB_CTL register  */
#define EMB_CTL_PORTINEN_POS                           (0U)
#define EMB_CTL_PORTINEN                               (0x00000001UL)
#define EMB_CTL_CMPEN1_POS                             (1U)
#define EMB_CTL_CMPEN1                                 (0x00000002UL)
#define EMB_CTL_CMPEN2_POS                             (2U)
#define EMB_CTL_CMPEN2                                 (0x00000004UL)
#define EMB_CTL_OSCSTPEN_POS                           (5U)
#define EMB_CTL_OSCSTPEN                               (0x00000020UL)
#define EMB_CTL_PWMSEN0_POS                            (6U)
#define EMB_CTL_PWMSEN0                                (0x00000040UL)
#define EMB_CTL_PWMSEN1_POS                            (7U)
#define EMB_CTL_PWMSEN1                                (0x00000080UL)
#define EMB_CTL_PWMSEN2_POS                            (8U)
#define EMB_CTL_PWMSEN2                                (0x00000100UL)
#define EMB_CTL_NFSEL_POS                              (28U)
#define EMB_CTL_NFSEL                                  (0x30000000UL)
#define EMB_CTL_NFEN_POS                               (30U)
#define EMB_CTL_NFEN                                   (0x40000000UL)
#define EMB_CTL_INVSEL_POS                             (31U)
#define EMB_CTL_INVSEL                                 (0x80000000UL)

/*  Bit definition for EMB_PWMLV register  */
#define EMB_PWMLV_PWMLV0_POS                           (0U)
#define EMB_PWMLV_PWMLV0                               (0x00000001UL)
#define EMB_PWMLV_PWMLV1_POS                           (1U)
#define EMB_PWMLV_PWMLV1                               (0x00000002UL)
#define EMB_PWMLV_PWMLV2_POS                           (2U)
#define EMB_PWMLV_PWMLV2                               (0x00000004UL)

/*  Bit definition for EMB_SOE register  */
#define EMB_SOE_SOE                                    (0x00000001UL)

/*  Bit definition for EMB_STAT register  */
#define EMB_STAT_PORTINF_POS                           (0U)
#define EMB_STAT_PORTINF                               (0x00000001UL)
#define EMB_STAT_PWMSF_POS                             (1U)
#define EMB_STAT_PWMSF                                 (0x00000002UL)
#define EMB_STAT_CMPF_POS                              (2U)
#define EMB_STAT_CMPF                                  (0x00000004UL)
#define EMB_STAT_OSF_POS                               (3U)
#define EMB_STAT_OSF                                   (0x00000008UL)
#define EMB_STAT_PORTINST_POS                          (4U)
#define EMB_STAT_PORTINST                              (0x00000010UL)
#define EMB_STAT_PWMST_POS                             (5U)
#define EMB_STAT_PWMST                                 (0x00000020UL)

/*  Bit definition for EMB_STATCLR register  */
#define EMB_STATCLR_PORTINFCLR_POS                     (0U)
#define EMB_STATCLR_PORTINFCLR                         (0x00000001UL)
#define EMB_STATCLR_PWMSFCLR_POS                       (1U)
#define EMB_STATCLR_PWMSFCLR                           (0x00000002UL)
#define EMB_STATCLR_CMPFCLR_POS                        (2U)
#define EMB_STATCLR_CMPFCLR                            (0x00000004UL)
#define EMB_STATCLR_OSFCLR_POS                         (3U)
#define EMB_STATCLR_OSFCLR                             (0x00000008UL)

/*  Bit definition for EMB_INTEN register  */
#define EMB_INTEN_PORTININTEN_POS                      (0U)
#define EMB_INTEN_PORTININTEN                          (0x00000001UL)
#define EMB_INTEN_PWMSINTEN_POS                        (1U)
#define EMB_INTEN_PWMSINTEN                            (0x00000002UL)
#define EMB_INTEN_CMPINTEN_POS                         (2U)
#define EMB_INTEN_CMPINTEN                             (0x00000004UL)
#define EMB_INTEN_OSINTEN_POS                          (3U)
#define EMB_INTEN_OSINTEN                              (0x00000008UL)

