MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
/*******************************************************************************
                Bit definition for Peripheral GPIO
*******************************************************************************/
/*  Bit definition for GPIO_PIDR0 register  */
#define GPIO_PIDR0_PIN0_POS                            (0U)
#define GPIO_PIDR0_PIN0                                (0x01U)
#define GPIO_PIDR0_PIN1_POS                            (1U)
#define GPIO_PIDR0_PIN1                                (0x02U)

/*  Bit definition for GPIO_PIDR1 register  */
#define GPIO_PIDR1_PIN0_POS                            (0U)
#define GPIO_PIDR1_PIN0                                (0x01U)
#define GPIO_PIDR1_PIN1_POS                            (1U)
#define GPIO_PIDR1_PIN1                                (0x02U)
#define GPIO_PIDR1_PIN2_POS                            (2U)
#define GPIO_PIDR1_PIN2                                (0x04U)
#define GPIO_PIDR1_PIN3_POS                            (3U)
#define GPIO_PIDR1_PIN3                                (0x08U)
#define GPIO_PIDR1_PIN4_POS                            (4U)
#define GPIO_PIDR1_PIN4                                (0x10U)
#define GPIO_PIDR1_PIN5_POS                            (5U)
#define GPIO_PIDR1_PIN5                                (0x20U)
#define GPIO_PIDR1_PIN6_POS                            (6U)
#define GPIO_PIDR1_PIN6                                (0x40U)
#define GPIO_PIDR1_PIN7_POS                            (7U)
#define GPIO_PIDR1_PIN7                                (0x80U)

/*  Bit definition for GPIO_PIDR2 register  */
#define GPIO_PIDR2_PIN0_POS                            (0U)
#define GPIO_PIDR2_PIN0                                (0x01U)
#define GPIO_PIDR2_PIN1_POS                            (1U)
#define GPIO_PIDR2_PIN1                                (0x02U)
#define GPIO_PIDR2_PIN2_POS                            (2U)
#define GPIO_PIDR2_PIN2                                (0x04U)
#define GPIO_PIDR2_PIN3_POS                            (3U)
#define GPIO_PIDR2_PIN3                                (0x08U)
#define GPIO_PIDR2_PIN4_POS                            (4U)
#define GPIO_PIDR2_PIN4                                (0x10U)
#define GPIO_PIDR2_PIN5_POS                            (5U)
#define GPIO_PIDR2_PIN5                                (0x20U)
#define GPIO_PIDR2_PIN6_POS                            (6U)
#define GPIO_PIDR2_PIN6                                (0x40U)
#define GPIO_PIDR2_PIN7_POS                            (7U)
#define GPIO_PIDR2_PIN7                                (0x80U)

/*  Bit definition for GPIO_PIDR3 register  */
#define GPIO_PIDR3_PIN0_POS                            (0U)
#define GPIO_PIDR3_PIN0                                (0x01U)
#define GPIO_PIDR3_PIN1_POS                            (1U)
#define GPIO_PIDR3_PIN1                                (0x02U)

/*  Bit definition for GPIO_PIDR4 register  */
#define GPIO_PIDR4_PIN0_POS                            (0U)
#define GPIO_PIDR4_PIN0                                (0x01U)
#define GPIO_PIDR4_PIN1_POS                            (1U)
#define GPIO_PIDR4_PIN1                                (0x02U)

/*  Bit definition for GPIO_PIDR5 register  */
#define GPIO_PIDR5_PIN0_POS                            (0U)
#define GPIO_PIDR5_PIN0                                (0x01U)
#define GPIO_PIDR5_PIN1_POS                            (1U)
#define GPIO_PIDR5_PIN1                                (0x02U)

/*  Bit definition for GPIO_PIDR6 register  */
#define GPIO_PIDR6_PIN0_POS                            (0U)
#define GPIO_PIDR6_PIN0                                (0x01U)
#define GPIO_PIDR6_PIN1_POS                            (1U)
#define GPIO_PIDR6_PIN1                                (0x02U)
#define GPIO_PIDR6_PIN2_POS                            (2U)
#define GPIO_PIDR6_PIN2                                (0x04U)
#define GPIO_PIDR6_PIN3_POS                            (3U)
#define GPIO_PIDR6_PIN3                                (0x08U)

/*  Bit definition for GPIO_PIDR7 register  */
#define GPIO_PIDR7_PIN0_POS                            (0U)
#define GPIO_PIDR7_PIN0                                (0x01U)
#define GPIO_PIDR7_PIN1_POS                            (1U)
#define GPIO_PIDR7_PIN1                                (0x02U)
#define GPIO_PIDR7_PIN2_POS                            (2U)
#define GPIO_PIDR7_PIN2                                (0x04U)
#define GPIO_PIDR7_PIN3_POS                            (3U)
#define GPIO_PIDR7_PIN3                                (0x08U)
#define GPIO_PIDR7_PIN4_POS                            (4U)
#define GPIO_PIDR7_PIN4                                (0x10U)
#define GPIO_PIDR7_PIN5_POS                            (5U)
#define GPIO_PIDR7_PIN5                                (0x20U)

/*  Bit definition for GPIO_PIDR12 register  */
#define GPIO_PIDR12_PIN0_POS                           (0U)
#define GPIO_PIDR12_PIN0                               (0x01U)
#define GPIO_PIDR12_PIN1_POS                           (1U)
#define GPIO_PIDR12_PIN1                               (0x02U)
#define GPIO_PIDR12_PIN2_POS                           (2U)
#define GPIO_PIDR12_PIN2                               (0x04U)
#define GPIO_PIDR12_PIN3_POS                           (3U)
#define GPIO_PIDR12_PIN3                               (0x08U)
#define GPIO_PIDR12_PIN4_POS                           (4U)
#define GPIO_PIDR12_PIN4                               (0x10U)

/*  Bit definition for GPIO_PIDR13 register  */
#define GPIO_PIDR13_PIN0_POS                           (0U)
#define GPIO_PIDR13_PIN0                               (0x01U)
#define GPIO_PIDR13_PIN7_POS                           (7U)
#define GPIO_PIDR13_PIN7                               (0x80U)

/*  Bit definition for GPIO_PIDR14 register  */
#define GPIO_PIDR14_PIN0_POS                           (0U)
#define GPIO_PIDR14_PIN0                               (0x01U)
#define GPIO_PIDR14_PIN6_POS                           (6U)
#define GPIO_PIDR14_PIN6                               (0x40U)
#define GPIO_PIDR14_PIN7_POS                           (7U)
#define GPIO_PIDR14_PIN7                               (0x80U)

/*  Bit definition for GPIO_PODR0 register  */
#define GPIO_PODR0_POUT0_POS                           (0U)
#define GPIO_PODR0_POUT0                               (0x01U)
#define GPIO_PODR0_POUT1_POS                           (1U)
#define GPIO_PODR0_POUT1                               (0x02U)

/*  Bit definition for GPIO_PODR1 register  */
#define GPIO_PODR1_POUT0_POS                           (0U)
#define GPIO_PODR1_POUT0                               (0x01U)
#define GPIO_PODR1_POUT1_POS                           (1U)
#define GPIO_PODR1_POUT1                               (0x02U)
#define GPIO_PODR1_POUT2_POS                           (2U)
#define GPIO_PODR1_POUT2                               (0x04U)
#define GPIO_PODR1_POUT3_POS                           (3U)
#define GPIO_PODR1_POUT3                               (0x08U)
#define GPIO_PODR1_POUT4_POS                           (4U)
#define GPIO_PODR1_POUT4                               (0x10U)
#define GPIO_PODR1_POUT5_POS                           (5U)
#define GPIO_PODR1_POUT5                               (0x20U)
#define GPIO_PODR1_POUT6_POS                           (6U)
#define GPIO_PODR1_POUT6                               (0x40U)
#define GPIO_PODR1_POUT7_POS                           (7U)
#define GPIO_PODR1_POUT7                               (0x80U)

