MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
/*******************************************************************************
                Bit definition for Peripheral SWDT
*******************************************************************************/
/*  Bit definition for SWDT_CR register  */
#define SWDT_CR_PERI_POS                               (0U)
#define SWDT_CR_PERI                                   (0x00000003UL)
#define SWDT_CR_PERI_0                                 (0x00000001UL)
#define SWDT_CR_PERI_1                                 (0x00000002UL)
#define SWDT_CR_CKS_POS                                (4U)
#define SWDT_CR_CKS                                    (0x000000F0UL)
#define SWDT_CR_CKS_0                                  (0x00000010UL)
#define SWDT_CR_CKS_1                                  (0x00000020UL)
#define SWDT_CR_CKS_2                                  (0x00000040UL)
#define SWDT_CR_CKS_3                                  (0x00000080UL)
#define SWDT_CR_WDPT_POS                               (8U)
#define SWDT_CR_WDPT                                   (0x00000F00UL)
#define SWDT_CR_WDPT_0                                 (0x00000100UL)
#define SWDT_CR_WDPT_1                                 (0x00000200UL)
#define SWDT_CR_WDPT_2                                 (0x00000400UL)
#define SWDT_CR_WDPT_3                                 (0x00000800UL)
#define SWDT_CR_SLPOFF_POS                             (16U)
#define SWDT_CR_SLPOFF                                 (0x00010000UL)
#define SWDT_CR_ITS_POS                                (31U)
#define SWDT_CR_ITS                                    (0x80000000UL)

/*  Bit definition for SWDT_SR register  */
#define SWDT_SR_CNT_POS                                (0U)
#define SWDT_SR_CNT                                    (0x0000FFFFUL)
#define SWDT_SR_CNT_0                                  (0x00000001UL)
#define SWDT_SR_CNT_1                                  (0x00000002UL)
#define SWDT_SR_CNT_2                                  (0x00000004UL)
#define SWDT_SR_CNT_3                                  (0x00000008UL)
#define SWDT_SR_CNT_4                                  (0x00000010UL)
#define SWDT_SR_CNT_5                                  (0x00000020UL)
#define SWDT_SR_CNT_6                                  (0x00000040UL)
#define SWDT_SR_CNT_7                                  (0x00000080UL)
#define SWDT_SR_CNT_8                                  (0x00000100UL)
#define SWDT_SR_CNT_9                                  (0x00000200UL)
#define SWDT_SR_CNT_10                                 (0x00000400UL)
#define SWDT_SR_CNT_11                                 (0x00000800UL)
#define SWDT_SR_CNT_12                                 (0x00001000UL)
#define SWDT_SR_CNT_13                                 (0x00002000UL)
#define SWDT_SR_CNT_14                                 (0x00004000UL)
#define SWDT_SR_CNT_15                                 (0x00008000UL)
#define SWDT_SR_UDF_POS                                (16U)
#define SWDT_SR_UDF                                    (0x00010000UL)
#define SWDT_SR_REF_POS                                (17U)
#define SWDT_SR_REF                                    (0x00020000UL)

/*  Bit definition for SWDT_RR register  */
#define SWDT_RR_RF                                     (0x0000FFFFUL)
#define SWDT_RR_RF_0                                   (0x00000001UL)
#define SWDT_RR_RF_1                                   (0x00000002UL)
#define SWDT_RR_RF_2                                   (0x00000004UL)
#define SWDT_RR_RF_3                                   (0x00000008UL)
#define SWDT_RR_RF_4                                   (0x00000010UL)
#define SWDT_RR_RF_5                                   (0x00000020UL)
#define SWDT_RR_RF_6                                   (0x00000040UL)
#define SWDT_RR_RF_7                                   (0x00000080UL)
#define SWDT_RR_RF_8                                   (0x00000100UL)
#define SWDT_RR_RF_9                                   (0x00000200UL)
#define SWDT_RR_RF_10                                  (0x00000400UL)
#define SWDT_RR_RF_11                                  (0x00000800UL)
#define SWDT_RR_RF_12                                  (0x00001000UL)
#define SWDT_RR_RF_13                                  (0x00002000UL)
#define SWDT_RR_RF_14                                  (0x00004000UL)
#define SWDT_RR_RF_15                                  (0x00008000UL)

/*******************************************************************************
                Bit definition for Peripheral TMR0
*******************************************************************************/
/*  Bit definition for TMR0_CNTAR register  */
#define TMR0_CNTAR_CNTA                                (0x0000FFFFUL)
#define TMR0_CNTAR_CNTA_0                              (0x00000001UL)
#define TMR0_CNTAR_CNTA_1                              (0x00000002UL)
#define TMR0_CNTAR_CNTA_2                              (0x00000004UL)
#define TMR0_CNTAR_CNTA_3                              (0x00000008UL)
#define TMR0_CNTAR_CNTA_4                              (0x00000010UL)
#define TMR0_CNTAR_CNTA_5                              (0x00000020UL)
#define TMR0_CNTAR_CNTA_6                              (0x00000040UL)
#define TMR0_CNTAR_CNTA_7                              (0x00000080UL)
#define TMR0_CNTAR_CNTA_8                              (0x00000100UL)
#define TMR0_CNTAR_CNTA_9                              (0x00000200UL)
#define TMR0_CNTAR_CNTA_10                             (0x00000400UL)
#define TMR0_CNTAR_CNTA_11                             (0x00000800UL)
#define TMR0_CNTAR_CNTA_12                             (0x00001000UL)
#define TMR0_CNTAR_CNTA_13                             (0x00002000UL)
#define TMR0_CNTAR_CNTA_14                             (0x00004000UL)
#define TMR0_CNTAR_CNTA_15                             (0x00008000UL)

/*  Bit definition for TMR0_CMPAR register  */
#define TMR0_CMPAR_CMPA                                (0x0000FFFFUL)
#define TMR0_CMPAR_CMPA_0                              (0x00000001UL)
#define TMR0_CMPAR_CMPA_1                              (0x00000002UL)
#define TMR0_CMPAR_CMPA_2                              (0x00000004UL)
#define TMR0_CMPAR_CMPA_3                              (0x00000008UL)
#define TMR0_CMPAR_CMPA_4                              (0x00000010UL)
#define TMR0_CMPAR_CMPA_5                              (0x00000020UL)
#define TMR0_CMPAR_CMPA_6                              (0x00000040UL)
#define TMR0_CMPAR_CMPA_7                              (0x00000080UL)
#define TMR0_CMPAR_CMPA_8                              (0x00000100UL)
#define TMR0_CMPAR_CMPA_9                              (0x00000200UL)
#define TMR0_CMPAR_CMPA_10                             (0x00000400UL)
#define TMR0_CMPAR_CMPA_11                             (0x00000800UL)
#define TMR0_CMPAR_CMPA_12                             (0x00001000UL)
#define TMR0_CMPAR_CMPA_13                             (0x00002000UL)
#define TMR0_CMPAR_CMPA_14                             (0x00004000UL)
#define TMR0_CMPAR_CMPA_15                             (0x00008000UL)

/*  Bit definition for TMR0_BCONR register  */
#define TMR0_BCONR_CSTA_POS                            (0U)
#define TMR0_BCONR_CSTA                                (0x00000001UL)
#define TMR0_BCONR_CAPMDA_POS                          (1U)
#define TMR0_BCONR_CAPMDA                              (0x00000002UL)
#define TMR0_BCONR_INTENA_POS                          (2U)
#define TMR0_BCONR_INTENA                              (0x00000004UL)
#define TMR0_BCONR_CKDIVA_POS                          (4U)
#define TMR0_BCONR_CKDIVA                              (0x000000F0UL)
#define TMR0_BCONR_CKDIVA_0                            (0x00000010UL)
#define TMR0_BCONR_CKDIVA_1                            (0x00000020UL)
#define TMR0_BCONR_CKDIVA_2                            (0x00000040UL)
#define TMR0_BCONR_CKDIVA_3                            (0x00000080UL)
#define TMR0_BCONR_SYNSA_POS                           (8U)
#define TMR0_BCONR_SYNSA                               (0x00000100UL)
#define TMR0_BCONR_SYNCLKA_POS                         (9U)
#define TMR0_BCONR_SYNCLKA                             (0x00000200UL)
#define TMR0_BCONR_HSTAA_POS                           (12U)
#define TMR0_BCONR_HSTAA                               (0x00001000UL)
#define TMR0_BCONR_HSTPA_POS                           (13U)
#define TMR0_BCONR_HSTPA                               (0x00002000UL)
#define TMR0_BCONR_HCLEA_POS                           (14U)
#define TMR0_BCONR_HCLEA                               (0x00004000UL)
#define TMR0_BCONR_HICPA_POS                           (15U)
#define TMR0_BCONR_HICPA                               (0x00008000UL)

/*  Bit definition for TMR0_STFLR register  */
#define TMR0_STFLR_CMFA                                (0x00000001UL)

