MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    __O  uint32_t POR2;
    __O  uint32_t POR3;
    __O  uint32_t POR4;
    __O  uint32_t POR5;
    uint32_t RESERVED0[2];
} stc_gpio_porr7_bit_t;

typedef struct {
    __O  uint32_t POR0;
    __O  uint32_t POR1;
    __O  uint32_t POR2;
    __O  uint32_t POR3;
    __O  uint32_t POR4;
    uint32_t RESERVED0[3];
} stc_gpio_porr12_bit_t;

typedef struct {
    __O  uint32_t POR0;
    uint32_t RESERVED0[6];
    __O  uint32_t POR7;
} stc_gpio_porr13_bit_t;

typedef struct {
    __O  uint32_t POR0;
    uint32_t RESERVED0[5];
    __O  uint32_t POR6;
    __O  uint32_t POR7;
} stc_gpio_porr14_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_gpio_potr0_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    __O  uint32_t POT3;
    __O  uint32_t POT4;
    __O  uint32_t POT5;
    __O  uint32_t POT6;
    __O  uint32_t POT7;
} stc_gpio_potr1_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    __O  uint32_t POT3;
    __O  uint32_t POT4;
    __O  uint32_t POT5;
    __O  uint32_t POT6;
    __O  uint32_t POT7;
} stc_gpio_potr2_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_gpio_potr3_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_gpio_potr4_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    uint32_t RESERVED0[6];
} stc_gpio_potr5_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    __O  uint32_t POT3;
    uint32_t RESERVED0[4];
} stc_gpio_potr6_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    __O  uint32_t POT3;
    __O  uint32_t POT4;
    __O  uint32_t POT5;
    uint32_t RESERVED0[2];
} stc_gpio_potr7_bit_t;

typedef struct {
    __O  uint32_t POT0;
    __O  uint32_t POT1;
    __O  uint32_t POT2;
    __O  uint32_t POT3;
    __O  uint32_t POT4;
    uint32_t RESERVED0[3];
} stc_gpio_potr12_bit_t;

typedef struct {
    __O  uint32_t POT0;
    uint32_t RESERVED0[6];
    __O  uint32_t POT7;
} stc_gpio_potr13_bit_t;

typedef struct {
    __O  uint32_t POT0;
    uint32_t RESERVED0[5];
    __O  uint32_t POT6;
    __O  uint32_t POT7;
} stc_gpio_potr14_bit_t;

typedef struct {
    __IO uint32_t POUT;
    __IO uint32_t POUTE;
    __IO uint32_t NOD;
    uint32_t RESERVED0[1];
    __IO uint32_t DRV;
    __IO uint32_t LTE;
    __IO uint32_t PUU;
    uint32_t RESERVED1[1];
    __I  uint32_t PIN;
    __IO uint32_t INVE;
    __IO uint32_t CINSEL;
    __IO uint32_t INTE;
    uint32_t RESERVED2[4];
} stc_gpio_pcr_bit_t;

typedef struct {
    __IO uint32_t PINAE0;
    __IO uint32_t PINAE1;
    __IO uint32_t PINAE2;
    __IO uint32_t PINAE3;
    __IO uint32_t PINAE4;
    __IO uint32_t PINAE5;
    __IO uint32_t PINAE6;
    __IO uint32_t PINAE7;
    uint32_t RESERVED0[4];
    __IO uint32_t PINAE12;
    __IO uint32_t PINAE13;
    __IO uint32_t PINAE14;
    uint32_t RESERVED1[1];
} stc_gpio_pinaer_bit_t;

typedef struct {
    __IO uint32_t WE;
    uint32_t RESERVED0[15];
} stc_gpio_pwpr_bit_t;

typedef struct {
    __IO uint32_t PE;
    __IO uint32_t SMBUS;
    __IO uint32_t SMBALRTEN;
    __IO uint32_t SMBDEFAULTEN;
    __IO uint32_t SMBHOSTEN;
    __IO uint32_t FACKEN;
    __IO uint32_t GCEN;
    __IO uint32_t RESTART;
    __IO uint32_t START;
    __IO uint32_t STOP;
    __IO uint32_t ACK;
    uint32_t RESERVED0[4];
    __IO uint32_t SWRST;
    uint32_t RESERVED1[16];
} stc_i2c_cr1_bit_t;

typedef struct {
    __IO uint32_t STARTIE;
    __IO uint32_t SLADDR0IE;
    __IO uint32_t SLADDR1IE;
    __IO uint32_t TENDIE;
    __IO uint32_t STOPIE;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLIE;
    __IO uint32_t TEMPTYIE;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOIE;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKIE;
    uint32_t RESERVED3[7];
    __IO uint32_t GENCALLIE;
    __IO uint32_t SMBDEFAULTIE;
    __IO uint32_t SMBHOSTIE;
    __IO uint32_t SMBALRTIE;
    uint32_t RESERVED4[8];
} stc_i2c_cr2_bit_t;

typedef struct {
    uint32_t RESERVED0[10];
    __IO uint32_t BUSWAIT;
    uint32_t RESERVED1[21];
} stc_i2c_cr4_bit_t;

typedef struct {
    uint32_t RESERVED0[12];
    __IO uint32_t SLADDR0EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD0;
    uint32_t RESERVED2[16];
} stc_i2c_slr0_bit_t;

typedef struct {
    uint32_t RESERVED0[12];
    __IO uint32_t SLADDR1EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD1;
    uint32_t RESERVED2[16];
} stc_i2c_slr1_bit_t;

typedef struct {
    __I  uint32_t STARTF;
    __I  uint32_t SLADDR0F;
    __I  uint32_t SLADDR1F;
    __I  uint32_t TENDF;
    __I  uint32_t STOPF;
    uint32_t RESERVED0[1];
    __I  uint32_t RFULLF;
    __I  uint32_t TEMPTYF;
    uint32_t RESERVED1[1];
    __I  uint32_t ARLOF;
    __I  uint32_t ACKRF;
    uint32_t RESERVED2[1];
    __I  uint32_t NACKF;
    uint32_t RESERVED3[3];
    __IO uint32_t MSL;
    __I  uint32_t BUSY;
    __IO uint32_t TRA;
    uint32_t RESERVED4[1];
    __I  uint32_t GENCALLF;
    __I  uint32_t SMBDEFAULTF;
    __I  uint32_t SMBHOSTF;
    __I  uint32_t SMBALRTF;
    uint32_t RESERVED5[8];
} stc_i2c_sr_bit_t;

typedef struct {
    __O  uint32_t STARTFCLR;
    __O  uint32_t SLADDR0FCLR;
    __O  uint32_t SLADDR1FCLR;
    __O  uint32_t TENDFCLR;
    __O  uint32_t STOPFCLR;
    uint32_t RESERVED0[1];
    __O  uint32_t RFULLFCLR;
    __O  uint32_t TEMPTYFCLR;
    uint32_t RESERVED1[1];
    __O  uint32_t ARLOFCLR;
    uint32_t RESERVED2[2];
    __O  uint32_t NACKFCLR;
    uint32_t RESERVED3[7];
    __O  uint32_t GENCALLFCLR;
    __O  uint32_t SMBDEFAULTFCLR;
    __O  uint32_t SMBHOSTFCLR;
    __O  uint32_t SMBALRTFCLR;
    uint32_t RESERVED4[8];
} stc_i2c_clr_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t DNFEN;
    __IO uint32_t ANFEN;
    uint32_t RESERVED1[26];
} stc_i2c_fltr_bit_t;

