MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M120J6TB/mcu.h
typedef struct {
    uint32_t                                 RESERVED0[1024];
    stc_tmra_bcstrl_bit_t                    BCSTRL_b;
    stc_tmra_bcstrh_bit_t                    BCSTRH_b;
    uint32_t                                 RESERVED1[16];
    stc_tmra_hconr_bit_t                     HCONR_b;
    uint32_t                                 RESERVED2[16];
    stc_tmra_hcupr_bit_t                     HCUPR_b;
    uint32_t                                 RESERVED3[16];
    stc_tmra_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED4[16];
    stc_tmra_iconr_bit_t                     ICONR_b;
    uint32_t                                 RESERVED5[16];
    stc_tmra_econr_bit_t                     ECONR_b;
    uint32_t                                 RESERVED6[16];
    stc_tmra_fconr_bit_t                     FCONR_b;
    uint32_t                                 RESERVED7[16];
    stc_tmra_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED8[272];
    stc_tmra_bconr_bit_t                     BCONR_b;
    uint32_t                                 RESERVED9[496];
    stc_tmra_cconr_bit_t                     CCONR1_b;
    uint32_t                                 RESERVED10[16];
    stc_tmra_cconr_bit_t                     CCONR2_b;
    uint32_t                                 RESERVED11[464];
    stc_tmra_pconr_bit_t                     PCONR1_b;
    uint32_t                                 RESERVED12[16];
    stc_tmra_pconr_bit_t                     PCONR2_b;
} bCM_TMRA_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[1024];
    stc_tmrb_bcstrl_bit_t                    BCSTRL_b;
    stc_tmrb_bcstrh_bit_t                    BCSTRH_b;
    uint32_t                                 RESERVED1[16];
    stc_tmrb_hconr_bit_t                     HCONR_b;
    uint32_t                                 RESERVED2[16];
    stc_tmrb_hcupr_bit_t                     HCUPR_b;
    uint32_t                                 RESERVED3[16];
    stc_tmrb_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED4[16];
    stc_tmrb_iconr_bit_t                     ICONR_b;
    uint32_t                                 RESERVED5[16];
    stc_tmrb_econr_bit_t                     ECONR_b;
    uint32_t                                 RESERVED6[48];
    stc_tmrb_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED7[784];
    stc_tmrb_cconr_bit_t                     CCONR_b;
    uint32_t                                 RESERVED8[496];
    stc_tmrb_pconr_bit_t                     PCONR_b;
} bCM_TMRB_TypeDef;

typedef struct {
    stc_usart_sr_bit_t                       SR_b;
    stc_usart_tdr_bit_t                      TDR_b;
    uint32_t                                 RESERVED0[48];
    stc_usart_cr1_bit_t                      CR1_b;
    stc_usart_cr2_bit_t                      CR2_b;
    stc_usart_cr3_bit_t                      CR3_b;
} bCM_USART_TypeDef;


/******************************************************************************/
/*      Device Specific Peripheral bit_band declaration & memory map          */
/******************************************************************************/
#define bCM_ADC                              ((bCM_ADC_TypeDef *)0x42170000UL)
#define bCM_AOS                              ((bCM_AOS_TypeDef *)0x42018000UL)
#define bCM_CMP1                             ((bCM_CMP_TypeDef *)0x42190000UL)
#define bCM_CMP2                             ((bCM_CMP_TypeDef *)0x42190200UL)
#define bCM_CMU                              ((bCM_CMU_TypeDef *)0x42288000UL)
#define bCM_CRC                              ((bCM_CRC_TypeDef *)0x422A8000UL)
#define bCM_CTC                              ((bCM_CTC_TypeDef *)0x42000000UL)
#define bCM_DBGC                             ((bCM_DBGC_TypeDef *)0x422A0000UL)
#define bCM_DMA                              ((bCM_DMA_TypeDef *)0x42260000UL)
#define bCM_EFM                              ((bCM_EFM_TypeDef *)0x42010000UL)
#define bCM_EMB                              ((bCM_EMB_TypeDef *)0x420D8000UL)
#define bCM_GPIO                             ((bCM_GPIO_TypeDef *)0x42270000UL)
#define bCM_I2C                              ((bCM_I2C_TypeDef *)0x42090000UL)
#define bCM_INTC                             ((bCM_INTC_TypeDef *)0x42220000UL)
#define bCM_PWC                              ((bCM_PWC_TypeDef *)0x42280000UL)
#define bCM_RMU                              ((bCM_RMU_TypeDef *)0x42282000UL)
#define bCM_SPI                              ((bCM_SPI_TypeDef *)0x42070000UL)
#define bCM_SWDT                             ((bCM_SWDT_TypeDef *)0x42198000UL)
#define bCM_TMR0                             ((bCM_TMR0_TypeDef *)0x420B0000UL)
#define bCM_TMR2                             ((bCM_TMR2_TypeDef *)0x420C0000UL)
#define bCM_TMR4                             ((bCM_TMR4_TypeDef *)0x420D0000UL)
#define bCM_TMRA                             ((bCM_TMRA_TypeDef *)0x420E0000UL)
#define bCM_TMRB_1                           ((bCM_TMRB_TypeDef *)0x420F0000UL)
#define bCM_TMRB_2                           ((bCM_TMRB_TypeDef *)0x420F8000UL)
#define bCM_TMRB_3                           ((bCM_TMRB_TypeDef *)0x42100000UL)
#define bCM_TMRB_4                           ((bCM_TMRB_TypeDef *)0x42108000UL)
#define bCM_USART1                           ((bCM_USART_TypeDef *)0x42030000UL)
#define bCM_USART2                           ((bCM_USART_TypeDef *)0x42038000UL)
#define bCM_USART3                           ((bCM_USART_TypeDef *)0x42040000UL)


#ifdef __cplusplus
}
#endif

#endif /* __HC32M120J6TB_H__ */
